RhinoInside.Revit API Documentation
GeometryDecoder.ToPoint Method
 Converts the specified Autodesk.Revit.DB.Point to an equivalent Rhino.Geometry.Point.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.Point ToPoint(
	this Autodesk.Revit.DB.Point point
)
@staticmethod
def ToPoint(
	point: Autodesk.Revit.DB.Point
) -> Rhino.Geometry.Point
Parameters
point
Type: Autodesk.Revit.DB.Point
Revit point to convert.
Return Value
Type: Rhino.Geometry.Point
Rhino point that is equivalent to the provided Revit point.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Point. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPoint(Point) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Point rhinoPoint = revitPoint.ToPoint();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_point = revit_point.ToPoint() # type: RG.Point
 Using ToPoint(Point) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Point rhinoPoint = GeometryEncoder.ToPoint(revitPoint)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_point = GD.ToPoint(revit_point) # type: RG.Point
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace